In [1]:
import pandas as pd

In [15]:
df = pd.read_csv("./nse5paisaScriptMaster.csv")

In [16]:
df.head()

,Unnamed: 0,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
0,0,N,D,49343,NIFTY 31 Mar 2022 CE 18000.00 ...,XX,2022-03-31 14:30:00,CE,18000.0,,NIFTY,NIFTY 31 Mar 2022 CE 18000.00
1,1,N,D,49344,NIFTY 31 Mar 2022 PE 18000.00 ...,XX,2022-03-31 14:30:00,PE,18000.0,,NIFTY,NIFTY 31 Mar 2022 PE 18000.00
2,2,N,D,49345,BANKNIFTY 30 Sep 2021 CE 36800.00 ...,XX,2021-09-30 14:30:00,CE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36800.00
3,3,N,D,49346,BANKNIFTY 30 Sep 2021 PE 36800.00 ...,XX,2021-09-30 14:30:00,PE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 PE 36800.00
4,4,N,D,49347,BANKNIFTY 30 Sep 2021 CE 36900.00 ...,XX,2021-09-30 14:30:00,CE,36900.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36900.00

In [17]:
df.columns

Index(['Unnamed: 0', 'Exch', 'ExchType', 'Scripcode', 'Name', 'Series',
       'Expiry', 'CpType', 'StrikeRate', 'WireCat', 'ISIN', 'FullName'],
      dtype='object')

In [18]:
df.drop('Unnamed: 0', axis=1,inplace=True)

In [19]:
df.head()

,Exch,ExchType,Scripcode,Name,Series,Expiry,CpType,StrikeRate,WireCat,ISIN,FullName
0,N,D,49343,NIFTY 31 Mar 2022 CE 18000.00 ...,XX,2022-03-31 14:30:00,CE,18000.0,,NIFTY,NIFTY 31 Mar 2022 CE 18000.00
1,N,D,49344,NIFTY 31 Mar 2022 PE 18000.00 ...,XX,2022-03-31 14:30:00,PE,18000.0,,NIFTY,NIFTY 31 Mar 2022 PE 18000.00
2,N,D,49345,BANKNIFTY 30 Sep 2021 CE 36800.00 ...,XX,2021-09-30 14:30:00,CE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36800.00
3,N,D,49346,BANKNIFTY 30 Sep 2021 PE 36800.00 ...,XX,2021-09-30 14:30:00,PE,36800.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 PE 36800.00
4,N,D,49347,BANKNIFTY 30 Sep 2021 CE 36900.00 ...,XX,2021-09-30 14:30:00,CE,36900.0,,BANKNIFTY,BANKNIFTY 30 Sep 2021 CE 36900.00